# CentroidHorizontal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionRound..::..CentroidHorizontal Property
StructuralSectionRound Class See Also
---
Distance from centroid to the left extremites along horizontal axis.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double CentroidHorizontal { get; set; }
```

Visual Basic
---
```text
Public Property CentroidHorizontal As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CentroidHorizontal {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace